In [1]:
# *********** Testing skills for Data Cleaning *********
# *********** By Traore, Youssouf **********************

In [25]:
# We import libraries here.

import pandas as pd;
import numpy as np;
# This is new import
from numpy import nan as NA;

In [10]:
# Let's create an array

In [11]:
string_data = pd.Series(['aardvark', 'artichope', np.nan, 'avocado'])

In [12]:
string_data

0     aardvark
1    artichope
2          NaN
3      avocado
dtype: object

In [13]:
# From the output of the array, we can see that our missing NaN is displayed.

In [14]:
#Let's check if we can verify using the "isnull" method

In [15]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [16]:
# Automatically in boolean, we can see being "null" is false for all expect [2]

In [18]:
string_data[0] = None

In [19]:
# Now le's look at our array again

In [20]:
string_data

0         None
1    artichope
2          NaN
3      avocado
dtype: object

In [21]:
# On line 18, we set the first entry to None, using its indice in the array.
# Now we can very again using our isnull method

In [22]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [23]:
# We will using different ways to filter missing data. These methods are already in pandas, so there is
# very little coding to do.

In [26]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [27]:
# Let's drop all the NA

In [28]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [29]:
# As you can see above, all our NA have been dropped. But someone without familiarity with these methods
# might come up with something like this:

In [30]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [31]:
# It can easy like that. Just a new tool in the toolbox.

# Using dataframes

In [32]:
# Of course, there are just more than array as a data structure.

In [35]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                   [NA, NA, NA], [NA, 6.5, 3.]])

In [36]:
data_cleaned = data.dropna()

In [38]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [39]:
# But let's look at it after using dropna() that we used on line 36

In [42]:
data_cleaned

     0    1    2
0  1.0  6.5  3.0

In [43]:
# This is interesting because it drops any *row* with NA

In [44]:
# What if we just want rows that are all NA?

In [45]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [46]:
# What if we want to drop the column that contain the NA? Let's add a new column and test in on that

In [47]:
data[4] = NA

In [48]:
# Let's visualize data now

In [49]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [50]:
# Let's drop the column that contain all NA...We do it using the axis 1

In [51]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [52]:
# I am trying something here. Actually I found that this method can be using for example if you want to drop a 
# certain number of rows, counting from the top. Probably there are other methods to target different section.

In [53]:
df = pd.DataFrame(np.random.randn(7, 3))

In [54]:
df

          0         1         2
0  0.285159 -0.804025  0.993087
1  0.394952  0.220985  1.023881
2  0.208375  0.314265  0.399882
3  1.056450  0.873213 -0.768765
4  0.414572  1.203938 -0.806933
5  0.246342 -0.561993 -0.525853
6  2.040132  0.652899 -2.059264

In [55]:
df.iloc[:4, 1] = NA

In [56]:
df

          0         1         2
0  0.285159       NaN  0.993087
1  0.394952       NaN  1.023881
2  0.208375       NaN  0.399882
3  1.056450       NaN -0.768765
4  0.414572  1.203938 -0.806933
5  0.246342 -0.561993 -0.525853
6  2.040132  0.652899 -2.059264

In [57]:
# And here we can just drop the rows with NA in that using dropna (remember dropna will drop the rows)

In [58]:
df.dropna()

          0         1         2
4  0.414572  1.203938 -0.806933
5  0.246342 -0.561993 -0.525853
6  2.040132  0.652899 -2.059264

In [61]:
# Let's try this one also. But I didn't really understand this.

In [62]:
df.iloc[:2, 2] = NA

In [64]:
df

          0         1         2
0  0.285159       NaN       NaN
1  0.394952       NaN       NaN
2  0.208375       NaN  0.399882
3  1.056450       NaN -0.768765
4  0.414572  1.203938 -0.806933
5  0.246342 -0.561993 -0.525853
6  2.040132  0.652899 -2.059264

In [68]:
df.dropna(thresh=2)

          0         1         2
2  0.208375       NaN  0.399882
3  1.056450       NaN -0.768765
4  0.414572  1.203938 -0.806933
5  0.246342 -0.561993 -0.525853
6  2.040132  0.652899 -2.059264